In [1]:
%pip install pandas

Requirement already satisfied: pandas in /home/mih/anaconda3/envs/jupyter_env/lib/python3.13/site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in /home/mih/anaconda3/envs/jupyter_env/lib/python3.13/site-packages (from pandas) (2.3.5)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/mih/anaconda3/envs/jupyter_env/lib/python3.13/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /home/mih/anaconda3/envs/jupyter_env/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /home/mih/anaconda3/envs/jupyter_env/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in /home/mih/anaconda3/envs/jupyter_env/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [5]:
import pandas as pd

# Create the dogs DataFrame
data = {
    'Name': ['Bella', 'Charlie', 'Lucy', 'Cooper', 'Max', 'Stella', 'Bernie'],
    'Breed': ['Labrador', 'Poodle', 'Chow Chow', 'Schnauzer', 'Labrador', 'Chihuahua', 'St. Bernard'],
    'Color': ['Brown', 'Black', 'Brown', 'Gray', 'Black', 'Tan', 'White'],
    'Height (cm)': [56, 43, 46, 49, 59, 18, 77],
    'Weight (kg)': [25, 23, 22, 17, 29, 2, 74],
    'Date of Birth': ['2013-07-01', '2016-09-16', '2014-08-25', '2011-12-11', '2017-01-20', '2015-04-20', '2018-02-27']
}

dogs = pd.DataFrame(data)
print(dogs)

      Name        Breed  Color  Height (cm)  Weight (kg) Date of Birth
0    Bella     Labrador  Brown           56           25    2013-07-01
1  Charlie       Poodle  Black           43           23    2016-09-16
2     Lucy    Chow Chow  Brown           46           22    2014-08-25
3   Cooper    Schnauzer   Gray           49           17    2011-12-11
4      Max     Labrador  Black           59           29    2017-01-20
5   Stella    Chihuahua    Tan           18            2    2015-04-20
6   Bernie  St. Bernard  White           77           74    2018-02-27

In [9]:
dogs.head()

      Name      Breed  Color  Height (cm)  Weight (kg) Date of Birth
0    Bella   Labrador  Brown           56           25    2013-07-01
1  Charlie     Poodle  Black           43           23    2016-09-16
2     Lucy  Chow Chow  Brown           46           22    2014-08-25
3   Cooper  Schnauzer   Gray           49           17    2011-12-11
4      Max   Labrador  Black           59           29    2017-01-20

In [10]:
dogs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           7 non-null      object
 1   Breed          7 non-null      object
 2   Color          7 non-null      object
 3   Height (cm)    7 non-null      int64
 4   Weight (kg)    7 non-null      int64
 5   Date of Birth  7 non-null      object
dtypes: int64(2), object(4)
memory usage: 468.0+ bytes

In [11]:
dogs.shape

(7, 6)

In [12]:
dogs.describe()

       Height (cm)  Weight (kg)
count     7.000000     7.000000
mean     49.714286    27.428571
std      17.960274    22.292429
min      18.000000     2.000000
25%      44.500000    19.500000
50%      49.000000    23.000000
75%      57.500000    27.000000
max      77.000000    74.000000

In [13]:
dogs.values

array([['Bella', 'Labrador', 'Brown', 56, 25, '2013-07-01'],
       ['Charlie', 'Poodle', 'Black', 43, 23, '2016-09-16'],
       ['Lucy', 'Chow Chow', 'Brown', 46, 22, '2014-08-25'],
       ['Cooper', 'Schnauzer', 'Gray', 49, 17, '2011-12-11'],
       ['Max', 'Labrador', 'Black', 59, 29, '2017-01-20'],
       ['Stella', 'Chihuahua', 'Tan', 18, 2, '2015-04-20'],
       ['Bernie', 'St. Bernard', 'White', 77, 74, '2018-02-27']],
      dtype=object)

In [15]:
dogs.columns

Index(['Name', 'Breed', 'Color', 'Height (cm)', 'Weight (kg)',
       'Date of Birth'],
      dtype='object')

In [16]:
dogs.index

RangeIndex(start=0, stop=7, step=1)

In [18]:
dogs.sort_values("Weight (kg)")

      Name        Breed  Color  Height (cm)  Weight (kg) Date of Birth
5   Stella    Chihuahua    Tan           18            2    2015-04-20
3   Cooper    Schnauzer   Gray           49           17    2011-12-11
2     Lucy    Chow Chow  Brown           46           22    2014-08-25
1  Charlie       Poodle  Black           43           23    2016-09-16
0    Bella     Labrador  Brown           56           25    2013-07-01
4      Max     Labrador  Black           59           29    2017-01-20
6   Bernie  St. Bernard  White           77           74    2018-02-27

In [21]:
dogs.sort_values("Weight (kg)", ascending=False)

      Name        Breed  Color  Height (cm)  Weight (kg) Date of Birth
6   Bernie  St. Bernard  White           77           74    2018-02-27
4      Max     Labrador  Black           59           29    2017-01-20
0    Bella     Labrador  Brown           56           25    2013-07-01
1  Charlie       Poodle  Black           43           23    2016-09-16
2     Lucy    Chow Chow  Brown           46           22    2014-08-25
3   Cooper    Schnauzer   Gray           49           17    2011-12-11
5   Stella    Chihuahua    Tan           18            2    2015-04-20

In [22]:
dogs[["Color", "Breed"]]

   Color        Breed
0  Brown     Labrador
1  Black       Poodle
2  Brown    Chow Chow
3   Gray    Schnauzer
4  Black     Labrador
5    Tan    Chihuahua
6  White  St. Bernard

In [26]:
dogs[dogs["Height (cm)"] < 50].sort_values("Height (cm)", ascending=False)

      Name      Breed  Color  Height (cm)  Weight (kg) Date of Birth
3   Cooper  Schnauzer   Gray           49           17    2011-12-11
2     Lucy  Chow Chow  Brown           46           22    2014-08-25
1  Charlie     Poodle  Black           43           23    2016-09-16
5   Stella  Chihuahua    Tan           18            2    2015-04-20

In [32]:
dogs[(dogs["Height (cm)"] < 50) & (dogs["Color"].isin(["Brown", "Black"]))]

      Name      Breed  Color  Height (cm)  Weight (kg) Date of Birth
1  Charlie     Poodle  Black           43           23    2016-09-16
2     Lucy  Chow Chow  Brown           46           22    2014-08-25

In [36]:
dogs["Height (m)"] = dogs["Height (cm)"] / 100
dogs[["Height (m)", "Height (cm)"]]

   Height (m)  Height (cm)
0        0.56           56
1        0.43           43
2        0.46           46
3        0.49           49
4        0.59           59
5        0.18           18
6        0.77           77

In [39]:
dogs["BMI"] = dogs["Weight (kg)"] / dogs["Height (m)"] ** 2
bmi_lt_100 = dogs[dogs["BMI"] < 100]
bmi_lt_100_height = bmi_lt_100.sort_values("Height (cm)", ascending=False)
bmi_lt_100_height[["Name", "Height (cm)", "Weight (kg)"]]

     Name  Height (cm)  Weight (kg)
4     Max           59           29
0   Bella           56           25
3  Cooper           49           17
5  Stella           18            2